tap "anomalyco/tap"
tap "facebook/fb"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "leoafarias/fvm"
tap "nikitabobko/tap"
tap "rbenv/tap"
tap "romkatv/powerlevel10k"
# Run your GitHub Actions locally
brew "act"
# CLI toolkit for working with Akamai's APIs
brew "akamai"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Automation for Apps
brew "appium"
# Core application library for C
brew "glib"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Vector graphics library with cross-device output support
brew "cairo"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# DuckDuckGo from the terminal
brew "ddgr"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Text processing system for reStructuredText
brew "docutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Like cURL, but for gRPC
brew "grpcurl"
# Flexible API to implement spellchecking in GTK+ applications
brew "gspell"
# GUI toolkit
brew "gtk+"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Hex editor for the terminal with vi-like interface
brew "hexer"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Library for manipulating JPEG-2000 images
brew "jasper"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Simple terminal UI for git commands
brew "lazygit"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# Pager program similar to more
brew "less"
# Glib wrapper library around libgit2 git access library
brew "libgit2-glib"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# GObject plugin library
brew "libpeas"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Find what models run on your hardware
brew "llmfit"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line interface for New Relic
brew "newrelic-cli"
# HTTP/2 C Library
brew "nghttp2"
# Libraries for security-enabled client and server applications
brew "nss"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@17"
# Shell command parallelization utility
brew "parallel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Terraform
brew "hashicorp/tap/terraform"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# SSL/TLS cryptography library
brew "rbenv/tap/openssl@1.0"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Always on top window preview
cask "amitv87-pip"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
# Multi-platform web browser
cask "microsoft-edge"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# Manage and install Squid proxy cache
cask "squidman"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "amazonwebservices.amazon-q-vscode"
vscode "solomonkinard.git-blame"
