tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Shell plugin manager
brew "antibody"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# GNU Emacs text editor
brew "emacs"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# GitHub command-line tool
brew "gh"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNOME GUI client to view git repositories
brew "gitg"
# Like cURL, but for gRPC
brew "grpcurl"
# GUI toolkit
brew "gtk+"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Library for manipulating JPEG-2000 images
brew "jasper"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Development kit for the Java programming language
brew "openjdk"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Pager program similar to more
brew "less"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Shell command parallelization utility
brew "parallel"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Feature-rich console based todo list manager
brew "task"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Application launcher and productivity software
cask "alfred"
# Always on top window preview
cask "amitv87-pip"
# Android SDK component
cask "android-platform-tools"
# Client for the Dropbox cloud storage service
cask "dropbox"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# HTTP and GraphQL Client
cask "insomnia"
# Virtualizer for x86 hardware
cask "virtualbox"
mas "1Password 7", id: 1333542190
mas "Developer", id: 640199958
mas "Microsoft Remote Desktop", id: 1295203466
mas "Seashore", id: 1448648921
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
